# Lesson 1: Introduction to SQL

Structured Query Language (SQL) is a powerful language used for managing and manipulating relational databases. In this lesson, we'll cover the fundamental concepts of SQL using an example related to a company database.

## 1.1 Basics of SQL

SQL operates on relational databases, which are collections of tables that store data. A table is a two-dimensional structure with rows and columns. Each row represents a record, and each column represents a field.

**Example:**
```sql
-- Creating a simple table named 'employees'
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    department VARCHAR(50),
    salary DECIMAL(10, 2)
);

In this example, we create a table named 'employees' with columns for employee ID, first name, last name, department, and salary.

## 1.2 Querying Data

To retrieve data from a table, we use the `SELECT` statement.

**Example:**
```sql
-- Retrieving all columns from the 'employees' table
SELECT * FROM employees;

This query returns all rows and columns from the 'employees' table.

## 1.3 Filtering Data

We can filter data using the `WHERE` clause.

**Example:**
```sql
-- Retrieving employees in the 'Marketing' department
SELECT * FROM employees WHERE department = 'Marketing';

This query returns employees who work in the 'Marketing' department.

## 1.4 Sorting Data

Sorting is achieved with the `ORDER BY` clause.

**Example:**
```sql
-- Sorting employees by salary in descending order
SELECT * FROM employees ORDER BY salary DESC;

This query returns employees sorted by salary in descending order.

## 1.5 Updating Data

To modify existing records, we use the `UPDATE` statement.

**Example:**
```sql
-- Updating the salary of a specific employee
UPDATE employees SET salary = 75000.00 WHERE employee_id = 1;

This query updates the salary of the employee with ID 1.

## 1.6 Deleting Data

To remove records, we use the `DELETE` statement.

**Example:**
```sql
-- Deleting an employee with ID 2
DELETE FROM employees WHERE employee_id = 2;

This query deletes the record of the employee with ID 2.